# Prerequisites
  brew "mas" # Mac App Store CLI

# Essentials
  cask "keka" # archiver
  mas "Bitwarden", id: 1352778147 # password manager (App Store required for browser integration)
  mas "Coca", id: 1000808993 # prevent sleep
  # Browsers
    cask "firefox"
    cask "google-chrome"

# Productivity
  tap "smudge/smudge"
  brew "smudge/smudge/nightlight" # night shift CLI
  cask "chatgpt"
  cask "claude"
  cask "espanso" # text expander
  mas "Dropover", id: 1355679052 # easier drag'n'drop

# Communication
  cask "slack"  
  cask "telegram"

# Office
  cask "adobe-creative-cloud"
  cask "autodesk-fusion" # 3D modeling
  cask "google-drive"
  cask "prusaslicer" # 3D printing
  # Apple iWork
    mas "Keynote", id: 409183694
    mas "Numbers", id: 409203825
    mas "Pages", id: 409201541
  # Microsoft Office
    cask "microsoft-excel"
    cask "microsoft-onenote"
    cask "microsoft-powerpoint"
    cask "microsoft-word"

# Development
  brew "cmake" # build system for C++
  brew "gh" # GitHub CLI
  brew "git"
  brew "nano" # terminal text editor
  brew "shellcheck" # shell script linter
  tap "stripe/stripe-cli"
  brew "stripe/stripe-cli/stripe"
  cask "claude-code"
  cask "docker-desktop"
  cask "postman"
  cask "tower" # Git client
  cask "visual-studio-code" # code editor
  # Cloud
    brew "awscli"
    brew "cfn-lint" # AWS CloudFormation linter
    brew "cloudflared" # Cloudflare Tunnel
    cask "gcloud-cli"
    cask "session-manager-plugin" # AWS Session Manager
  # Database clients
    cask "mongodb-compass"
    cask "postico" # PostgreSQL client
    cask "redis-insight"
  # Version managers
    brew "nvm" # Node.js version manager
    brew "pyenv" # Python version manager
    brew "pyenv-virtualenv" # Python virtual environments
    brew "rbenv" # Ruby version manager
    brew "ruby-build"

# Fun
  cask "steam" # games
  # Media
    cask "iina" # media player
    cask "spotify"
    cask "vlc" # media player

# Utilities
  cask "balenaetcher" # OS images USB flasher
  cask "coconutbattery" # battery health monitoring
  cask "cyberduck" # FTP client
  cask "gifox" # GIF recorder
  cask "hazel" # file organizer
  cask "lunar" # external display brightness control
  cask "raspberry-pi-imager"
  cask "teamviewer"
  cask "virtualbuddy" # macOS VM
  cask "wifiman" # Ubiquiti WiFiman
  cask "windows-app" # Microsoft Windows remote desktop
  mas "iSignum – PostSignum", id: 6502943626 # PostSignum certificate manager
  # VPN
    brew "wireguard-tools"
    cask "tunnelblick" # OpenVPN
    mas "Wireguard", id: 1451685025
  # CLI tools
    brew "ffmpeg" # video converter
    brew "ghostscript" # PDF processor
    brew "gnupg" # encryption
    brew "imagemagick" # image processor
    brew "jq" # JSON processor
    brew "yq" # YAML processor
    brew "yt-dlp" # YouTube video downloader
    cask "dupeguru" # files deduplication

# Browser extensions
  mas "Hlídač Shopů", id: 1488295734

# Fonts
  cask "font-bebas-neue"
  cask "font-exo"
  cask "font-exo-2"
  cask "font-fira-code"
  cask "font-fira-mono"
  cask "font-fira-sans"
  cask "font-fira-sans-condensed"
  cask "font-fira-sans-extra-condensed"
  cask "font-monaspace"
  cask "font-montserrat"
  cask "font-montserrat-alternates"
  cask "font-montserrat-subrayada"
  cask "font-radio-canada"
  cask "font-roboto"
  cask "font-roboto-flex"
  cask "font-roboto-mono"
  cask "font-roboto-serif"
  cask "font-roboto-slab"
  cask "font-yrsa"

# Hardware
  brew "yubico-piv-tool"
  cask "1kc-razer" # Razer RGB control
  cask "eobcanka"
  cask "logi-options+"
  cask "wch-ch34x-usb-serial-driver"
  cask "yubico-authenticator"
