# Prerequisites
# -------------
# - Mac App Store CLI
brew 'mas'

# Essentials
# ----------
# – browsers
cask 'google-chrome'
cask 'firefox'
# – archiver
cask 'keka'
# – password manager
#   (Mac App Store required for browser integration)
mas 'Bitwarden', id: 1352778147
# - prevent sleep
mas 'Coca', id: 1000808993
# - prevent battery overcharge
cask 'aldente'

# Productivity
# ------------
# - window management
cask 'rectangle'
# - clean-up menu bar
cask 'bartender'
# - text expander
cask 'espanso'
# - clipboard manager
cask 'maccy'
# - easier drag'n'drop
mas 'Dropover', id: 1355679052
# - emoji picker
cask 'mumu-x'
# - night shift CLI
tap 'smudge/smudge'
brew 'smudge/smudge/nightlight'
# - ChatGPT
cask 'chatgpt'

# Communication
# -------------
# - Facebook Messenger
cask 'messenger'
# - Telegram
cask 'telegram'
# - Slack
cask 'slack'

# Office
# ------
# - Apple iWork
mas 'Pages', id: 409201541
mas 'Numbers', id: 409203825
mas 'Keynote', id: 409183694
# - Microsoft Office
cask 'microsoft-word'
cask 'microsoft-excel'
cask 'microsoft-powerpoint'
cask 'microsoft-onenote'
# - Adobe Creative Cloud
cask 'adobe-creative-cloud'
# - 3D modeling
cask 'autodesk-fusion'
# - Google Drive
cask 'google-drive'

# Development
# -----------
# - Git
brew 'git'
# - editors
brew 'nano'
cask 'visual-studio-code'
# - Docker
cask 'docker'
# - Git client
cask 'tower'
# - CLI autocomplete
cask 'amazon-q'
# - GitHub CLI
brew 'gh'
# - Node version manager
brew 'nvm'
# - Python version manager and virtualenv
brew 'pyenv'
brew 'pyenv-virtualenv'
# - Ruby version manager
brew 'rbenv'
brew 'ruby-build'
# - AWS CLI + Session Manager plugin
brew 'awscli'
cask 'session-manager-plugin'
# - AWS CloudFormation linter
brew 'cfn-lint'
# - Google Cloud SDK
cask 'google-cloud-sdk'
# - Cloudflare Tunnel
tap 'cloudflare/cloudflare'
brew 'cloudflare/cloudflare/cloudflared'
# - Postman
cask 'postman'
# - PostgreSQL client
cask 'postico'
# - MongoDB client
cask 'mongodb-compass'
# - Redis client
cask 'redisinsight'
# - Stripe CLI
tap 'stripe/stripe-cli'
brew 'stripe/stripe-cli/stripe'
# - build system for C++
brew 'cmake'

# Fun
# ---
# - music
cask 'spotify'
# - media players
cask 'iina'
cask 'vlc'

# Utilities
# ---------
# - OpenVPN client
cask 'tunnelblick'
# - WireGuard
mas 'Wireguard', id: 1451685025
brew 'wireguard-tools'
# - remote desktop
cask 'microsoft-remote-desktop'
# - external display brightness control
cask 'lunar'
# - FTP client
cask 'cyberduck'
# - OS images USB flasher
cask 'balenaetcher'
# - YouTube video downloader
brew 'yt-dlp'
# - GIF recorder
cask 'gifox'
# - file organizer
cask 'hazel'
# - video converter
brew 'ffmpeg'
# - JSON processor
brew 'jq'
# - encryption
brew 'gnupg'
# - files deduplication
cask 'dupeguru'
# - battery health monitoring
cask 'coconutbattery'

# Fonts
# -----
cask 'font-bebas-neue'
cask 'font-exo-2'
cask 'font-exo'
cask 'font-fira-code'
cask 'font-fira-mono'
cask 'font-fira-sans-condensed'
cask 'font-fira-sans-extra-condensed'
cask 'font-fira-sans'
cask 'font-monaspace'
cask 'font-montserrat-alternates'
cask 'font-montserrat-subrayada'
cask 'font-montserrat'
cask 'font-radio-canada'
cask 'font-roboto-flex'
cask 'font-roboto-mono'
cask 'font-roboto-serif'
cask 'font-roboto-slab'
cask 'font-roboto'
cask 'font-yrsa'

# Drivers
# -------
# - Logitech Options+
cask 'logi-options+'
# - Razer RGB control
cask '1kc-razer'
# - eObčanka
cask 'eobcanka'
# - HP printers
# cask 'apple-hewlett-packard-printer-drivers'
# - YubiKey
cask 'yubico-yubikey-manager'
brew 'yubico-piv-tool'
# USB to serial driver
cask 'wch-ch34x-usb-serial-driver'
