bierner.markdown-mermaid
GitHub.copilot
GitHub.copilot-chat
GitHub.vscode-github-actions
kddejong.vscode-cfn-lint
ms-azuretools.vscode-docker
testdouble.vscode-standard-ruby
bradlc.vscode-tailwindcss
esbenp.prettier-vscode
dbaeumer.vscode-eslint
redhat.vscode-xml
vue.volar

ms-vscode.hexeditor


krystof-k@krystofs-macbook-pro ~ % code --list-extensions
amazonwebservices.codewhisperer-for-command-line-companion
bierner.markdown-mermaid
bradlc.vscode-tailwindcss
dbaeumer.vscode-eslint
esbenp.prettier-vscode
github.copilot
github.copilot-chat
github.vscode-github-actions
kddejong.vscode-cfn-lint
ms-azuretools.vscode-docker
ms-ceintl.vscode-language-pack-cs
ms-vscode.cpptools
redhat.vscode-xml
testdouble.vscode-standard-ruby
ms-vscode.cpptools
